In [1]:
import pandas as pd
from urllib.request import urlretrieve

In [2]:
italy_covid_url = 'https://gist.githubusercontent.com/aakashns/f6a004fa20c84fec53262f9a8bfee775/raw/f309558b1cf5103424cef58e2ecb8704dcd4d74c/italy-covid-daywise.csv'

urlretrieve(italy_covid_url, 'italy-covid-daywise.csv')

('italy-covid-daywise.csv', <http.client.HTTPMessage at 0x28f3fac6c08>)

In [3]:
data = pd.read_csv(
    'italy-covid-daywise.csv',
    dtype={
        'date': 'object',
        'new_cases': 'float32',
        'new_deaths': 'float32',
        'new_tests': 'float32'
    }
)

#Specifying dtype would reduce the memory usage

#### Below you can observe the significant drop in memory usage when dtype is specified

In [4]:
pd.read_csv(
    'italy-covid-daywise.csv',
    dtype={
        'date': 'object',
        'new_cases': 'float16',
        'new_deaths': 'float16',
        'new_tests': 'float16'
    }
).memory_usage(deep=True)

Index           128
date          16616
new_cases       496
new_deaths      496
new_tests       496
dtype: int64

In [5]:
pd.read_csv(
    'italy-covid-daywise.csv',
).memory_usage(deep=True)

Index           128
date          16616
new_cases      1984
new_deaths     1984
new_tests      1984
dtype: int64

In [6]:
data.head()

         date  new_cases  new_deaths  new_tests
0  2019-12-31        0.0         0.0        NaN
1  2020-01-01        0.0         0.0        NaN
2  2020-01-02        0.0         0.0        NaN
3  2020-01-03        0.0         0.0        NaN
4  2020-01-04        0.0         0.0        NaN

In [7]:
data.info(verbose=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 248 entries, 0 to 247
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        248 non-null    object
 1   new_cases   248 non-null    float32
 2   new_deaths  248 non-null    float32
 3   new_tests   135 non-null    float32
dtypes: float32(3), object(1)
memory usage: 5.0+ KB

In [8]:
# Set the number of max columns or rows to be displayed

pd.options.display.max_columns = 10

In [9]:
data.memory_usage(deep=True)

Index           128
date          16616
new_cases       992
new_deaths      992
new_tests       992
dtype: int64

In [10]:
# Returns descriptive statistics of the data

data.describe(include='all')

              date    new_cases  new_deaths     new_tests
count          248   248.000000  248.000000    135.000000
unique         248          NaN         NaN           NaN
top     2019-12-31          NaN         NaN           NaN
freq             1          NaN         NaN           NaN
mean           NaN  1094.818604  143.133072  31699.673828
std            NaN  1554.508057  227.105545  11622.209961
min            NaN  -148.000000  -31.000000   7841.000000
25%            NaN   123.000000    3.000000  25259.000000
50%            NaN   342.000000   17.000000  29545.000000
75%            NaN  1371.750000  175.250000  37711.000000
max            NaN  6557.000000  971.000000  95273.000000

In [11]:
# Return 5 records at random

data.sample(5)

           date  new_cases  new_deaths  new_tests
172  2020-06-20     -148.0        47.0    29875.0
45   2020-02-14        0.0         0.0        NaN
176  2020-06-24      113.0        18.0    30237.0
206  2020-07-24      306.0        10.0    28970.0
23   2020-01-23        0.0         0.0        NaN

### Indexing data using `loc`, `iloc` and `at`

### Using `loc` we can access data by referencing to explict index and using `iloc` we can access data by referencing to implicit index

In [12]:
data.at[147, 'new_cases']

300.0

In [13]:
data.loc[147, :]

date          2020-05-26
new_cases          300.0
new_deaths          92.0
new_tests        33944.0
Name: 147, dtype: object

In [14]:
data.iloc[147, :]

date          2020-05-26
new_cases          300.0
new_deaths          92.0
new_tests        33944.0
Name: 147, dtype: object

#### Above we were able to use 147 for `loc` as well as `iloc` because there the index/label and integer position was equal to 144

In [15]:
new_data = data.sample(5).copy()
new_data

           date  new_cases  new_deaths  new_tests
65   2020-03-05      587.0        27.0        NaN
160  2020-06-08      197.0        53.0    16301.0
69   2020-03-09     1492.0       133.0        NaN
14   2020-01-14        0.0         0.0        NaN
44   2020-02-13        0.0         0.0        NaN

In [16]:
new_data.index

Int64Index([65, 160, 69, 14, 44], dtype='int64')

In [17]:
# We change index/label, so we will have to specify different values for loc and iloc

new_data.index = ['a', 'b', 'c', 'd', 'e']

In [18]:
new_data

         date  new_cases  new_deaths  new_tests
a  2020-03-05      587.0        27.0        NaN
b  2020-06-08      197.0        53.0    16301.0
c  2020-03-09     1492.0       133.0        NaN
d  2020-01-14        0.0         0.0        NaN
e  2020-02-13        0.0         0.0        NaN

#### `dataframe.loc['row_label', 'column_label']`

In [19]:
new_data.loc['a', :] # here `a` is explicit index

date          2020-03-05
new_cases          587.0
new_deaths          27.0
new_tests            NaN
Name: a, dtype: object

#### `dataframe.iloc['integer_position_of_row', 'integer_position_of_column']`

In [20]:
new_data.iloc[0, 0] # here 0 is implicit index

'2020-03-05'

#### `dataframe.at['row_label', 'column_label']`

In [21]:
new_data.at['a', 'new_cases']

587.0

In [22]:
new_data.head()

         date  new_cases  new_deaths  new_tests
a  2020-03-05      587.0        27.0        NaN
b  2020-06-08      197.0        53.0    16301.0
c  2020-03-09     1492.0       133.0        NaN
d  2020-01-14        0.0         0.0        NaN
e  2020-02-13        0.0         0.0        NaN

In [23]:
# Filter data and few columns without using `dataframe.loc`

data[data.new_cases>250][['new_cases', 'new_deaths']]

     new_cases  new_deaths
62       561.0         6.0
63       347.0        17.0
64       466.0        28.0
65       587.0        27.0
66       769.0        41.0
..         ...         ...
243     1444.0         1.0
244     1365.0         4.0
245      996.0         6.0
246      975.0         8.0
247     1326.0         6.0

[147 rows x 2 columns]

In [24]:
# Filter data and few columns using `dataframe.loc`

data.loc[data.new_cases>250, ['new_cases', 'new_deaths']]

     new_cases  new_deaths
62       561.0         6.0
63       347.0        17.0
64       466.0        28.0
65       587.0        27.0
66       769.0        41.0
..         ...         ...
243     1444.0         1.0
244     1365.0         4.0
245      996.0         6.0
246      975.0         8.0
247     1326.0         6.0

[147 rows x 2 columns]

In [40]:
# Check sum of null values across columns

data.isnull().sum()

date            0
new_cases       0
new_deaths      0
new_tests     113
dtype: int64

In [46]:
data_new = data.copy()

In [47]:
data_new.isnull().sum()

date            0
new_cases       0
new_deaths      0
new_tests     113
dtype: int64

In [48]:
data_new[data_new['new_tests'].isnull()]

           date  new_cases  new_deaths  new_tests
0    2019-12-31        0.0         0.0        NaN
1    2020-01-01        0.0         0.0        NaN
2    2020-01-02        0.0         0.0        NaN
3    2020-01-03        0.0         0.0        NaN
4    2020-01-04        0.0         0.0        NaN
..          ...        ...         ...        ...
108  2020-04-17     3786.0       525.0        NaN
109  2020-04-18     3493.0       575.0        NaN
110  2020-04-19     3491.0       480.0        NaN
246  2020-09-02      975.0         8.0        NaN
247  2020-09-03     1326.0         6.0        NaN

[113 rows x 4 columns]

In [49]:
# Here we are filling it with -1, but we can fill it with mean or something else as well

data_new.fillna(-1, inplace=True)

In [50]:
data_new[data_new.new_tests.isnull()]

Empty DataFrame
Columns: [date, new_cases, new_deaths, new_tests]
Index: []

In [26]:
# Count of unique values across coulmns

data.nunique()

date          248
new_cases     188
new_deaths    129
new_tests     135
dtype: int64

In [27]:
# Lists all unique values in a column

data.new_tests.unique()

array([   nan,  7841., 28095., 44248., 37083., 95273., 38676., 24113.,
       26678., 37554., 38589., 41441., 43732., 31231., 27047., 22999.,
       32211., 37771., 13665., 45428., 36091., 31384., 25823., 39620.,
       37049., 41131., 39027., 40657., 33505., 26101., 40226., 38617.,
       40644., 42987., 42579., 34206., 20676., 33944., 37299., 39838.,
       38233., 36051., 28948., 18053., 25628., 20035., 27451., 40470.,
       34036., 27894., 16301., 32200., 37865., 32991., 37651., 32880.,
       29545., 17463., 27762., 33957., 32921., 28570., 29875., 24581.,
       16152., 23225., 30237., 29421., 28331., 29721., 21183., 15484.,
       28471., 29325., 29147., 25680., 28946., 21166., 13771., 22490.,
       28679., 29947., 27251., 25449., 23061., 14006., 24222., 28392.,
       28089., 28661., 27569., 20621., 14121., 23915., 29288., 33018.,
       28970., 28059., 25177., 19374., 25341., 30875., 33396., 29686.,
       31905., 24496., 13467., 23491., 29739., 32169., 30392., 26631.,
       22773., 10904., 22063., 27330., 25629., 24868., 25937., 22470.,
       21379., 32687., 41290., 49662., 44943., 46613., 47463., 33358.,
       45798., 58054., 57640., 65135., 64294., 53541., 42583., 54395.],
      dtype=float32)

In [28]:
# Counts the occurence of values in a column

data.new_tests.value_counts()

7841.0     1
24222.0    1
25341.0    1
19374.0    1
25177.0    1
          ..
38233.0    1
39838.0    1
37299.0    1
33944.0    1
54395.0    1
Name: new_tests, Length: 135, dtype: int64

In [29]:
d = {
    'A': [1, 2, 3, 4, 5, 6, 1, 2, 3, 4],
    'City': ['Pune', 'Mumbai', 'Mumbai', 'Delhi', 'Bangalore', 'Pune', 'Mumbai', 'Mumbai', 'Delhi', 'Goa'],
    'B' :['A', 'B', 'C', 'W', 'P', 'A', 'O', 'Q', 'E', 'V']
}

In [30]:
dummy_data = pd.DataFrame(d)

In [31]:
dummy_data

   A       City  B
0  1       Pune  A
1  2     Mumbai  B
2  3     Mumbai  C
3  4      Delhi  W
4  5  Bangalore  P
5  6       Pune  A
6  1     Mumbai  O
7  2     Mumbai  Q
8  3      Delhi  E
9  4        Goa  V

### To find records which have city that occurs more than once - `'Mumbai', 'Pune', 'Delhi'`

In [32]:
a = dummy_data.City.value_counts() 
city_constraint_list = a[a > 1].index
city_constraint_list

Index(['Mumbai', 'Pune', 'Delhi'], dtype='object')

In [33]:
dummy_data[dummy_data.City.isin(city_constraint_list)]

   A    City  B
0  1    Pune  A
1  2  Mumbai  B
2  3  Mumbai  C
3  4   Delhi  W
5  6    Pune  A
6  1  Mumbai  O
7  2  Mumbai  Q
8  3   Delhi  E

In [34]:
dummy_data[dummy_data.groupby('City')['A'].transform('count')>1]

   A    City  B
0  1    Pune  A
1  2  Mumbai  B
2  3  Mumbai  C
3  4   Delhi  W
5  6    Pune  A
6  1  Mumbai  O
7  2  Mumbai  Q
8  3   Delhi  E

In [86]:
import requests

In [ ]:
url = "https://github.com/chris1610/pbpython/blob/master/data/sales_transactions.xlsx?raw=true"

In [87]:
r = requests.get(url).contenttent

In [90]:

urlretrieve(url, "sales_data.csv")

('sales_data.csv', <http.client.HTTPMessage at 0x28f47346248>)

In [95]:
sales_data = pd.read_excel(url)

In [97]:
sales_data.head()

   account           name  order       sku  quantity  unit price  ext price
0   383080       Will LLC  10001  B1-20000         7       33.69     235.83
1   383080       Will LLC  10001  S1-27722        11       21.12     232.32
2   383080       Will LLC  10001  B1-86481         3       35.99     107.97
3   412290  Jerde-Hilpert  10005  S1-06532        48       55.82    2679.36
4   412290  Jerde-Hilpert  10005  S1-82801        21       13.62     286.02

In [112]:
order_data = sales_data.groupby('order')['ext price'].sum().rename('total').reset_index()

In [113]:
order_data

   order    total
0  10001   576.12
1  10005  8185.49
2  10006  3724.49

In [114]:
new_df = sales_data.merge(order_data)

In [115]:
new_df

,account,name,order,sku,quantity,unit price,ext price,total
0,383080,Will LLC,10001,B1-20000,7,33.69,235.83,576.12
1,383080,Will LLC,10001,S1-27722,11,21.12,232.32,576.12
2,383080,Will LLC,10001,B1-86481,3,35.99,107.97,576.12
3,412290,Jerde-Hilpert,10005,S1-06532,48,55.82,2679.36,8185.49
4,412290,Jerde-Hilpert,10005,S1-82801,21,13.62,286.02,8185.49
5,412290,Jerde-Hilpert,10005,S1-06532,9,92.55,832.95,8185.49
6,412290,Jerde-Hilpert,10005,S1-47412,44,78.91,3472.04,8185.49
7,412290,Jerde-Hilpert,10005,S1-27722,36,25.42,915.12,8185.49
8,218895,Kulas Inc,10006,S1-27722,32,95.66,3061.12,3724.49
9,218895,Kulas Inc,10006,B1-33087,23,22.55,518.65,3724.49
10,218895,Kulas Inc,10006,B1-33364,3,72.30,216.90,3724.49
11,218895,Kulas Inc,10006,B1-20000,-1,72.18,-72.18,3724.49

In [116]:
new_df['percent'] = new_df['ext price'] / new_df['total']

In [117]:

new_df

,account,name,order,sku,quantity,unit price,ext price,total,percent
0,383080,Will LLC,10001,B1-20000,7,33.69,235.83,576.12,0.409342
1,383080,Will LLC,10001,S1-27722,11,21.12,232.32,576.12,0.403249
2,383080,Will LLC,10001,B1-86481,3,35.99,107.97,576.12,0.187409
3,412290,Jerde-Hilpert,10005,S1-06532,48,55.82,2679.36,8185.49,0.327330
4,412290,Jerde-Hilpert,10005,S1-82801,21,13.62,286.02,8185.49,0.034942
5,412290,Jerde-Hilpert,10005,S1-06532,9,92.55,832.95,8185.49,0.101759
6,412290,Jerde-Hilpert,10005,S1-47412,44,78.91,3472.04,8185.49,0.424170
7,412290,Jerde-Hilpert,10005,S1-27722,36,25.42,915.12,8185.49,0.111798
8,218895,Kulas Inc,10006,S1-27722,32,95.66,3061.12,3724.49,0.821890
9,218895,Kulas Inc,10006,B1-33087,23,22.55,518.65,3724.49,0.139254
10,218895,Kulas Inc,10006,B1-33364,3,72.30,216.90,3724.49,0.058236
11,218895,Kulas Inc,10006,B1-20000,-1,72.18,-72.18,3724.49,-0.019380